Rhino.SettingValue.#ctor(Rhino.PersistentSettings,System.String,System.String,System.String)
Constructor.
parent: PersistentSettings collection this is being added to.
name: Current value name.
value: Current value string.
defaultValue: Default value string.